backend/controllers/CashiersShiftController.php

    public function actionIndex()
    {
        $NecessaryDate = '(^(((\d\d)(([02468][048])|([13579][26]))-02-29)|(((\d\d)(\d\d)))-((((0\d)|(1[0-2]))-((0\d)|(1\d)|(2[0-8])))|((((0[13578])|(1[02]))-31)|(((0[1,3-9])|(1[0-2]))-(29|30)))))$)';
        $start_date = /*Yii::$app->request->post('date_from');*/ '2016-04-15';
        $end_date = /*Yii::$app->request->post('date_to');*/ '2016-05-01';
        if (Yii::$app->request->post('table') == 'shifts') {
            if (preg_match($NecessaryDate, $start_date) && preg_match($NecessaryDate, $end_date)) {


                $TakeShifts = CashdeskTimesheet::find()->
                where(['BETWEEN', 'opendt', $start_date, $end_date])->
                orWhere(['BETWEEN', 'closedt', $start_date, $end_date])->
                asArray()->all();

                if (!empty($TakeShifts) && isset($TakeShifts) && $TakeShifts !== null && $TakeShifts !== '') {


                    $CashierDataResult = [];
                    foreach ($TakeShifts as $valueShifts) {
                        $jsonValuesForCashierDate = new \stdClass();
                        $jsonValuesForCashierDate->shift_id = $valueShifts['id'];
                        $jsonValuesForCashierDate->shift_cashdesk = $valueShifts['cashdesk'];
                        $jsonValuesForCashierDate->shift_opendt = $valueShifts['opendt'];
                        $jsonValuesForCashierDate->shift_closedt = $valueShifts['closedt'];
                        $jsonValuesForCashierDate->cashier_id = $valueShifts['cashier'];

                        $TakeCashier = Cashier::find()->where(['=', 'id', $valueShifts['cashier']])->orderBy('id')->limit(1)->asArray()->all();
---
SELECT * FROM "cashdesk_timesheet" WHERE ("opendt" BETWEEN '2016-04-15' AND '2016-05-01') OR ("closedt" BETWEEN '2016-04-15' AND '2016-05-01')
SELECT * FROM "cashier" WHERE "id" = 444 ORDER BY "id" LIMIT 1