backend/controllers/CashierController.php

    public function actionInfo()
    {
        if(Yii::$app->request->post('table') == 'cashierdata') {

            $AllCashier = Cashier::find()->asArray()->all();

            $jsonCashierInfo = [];
            foreach ($AllCashier as $valueCashier) {
                $jsonValuesForCashier = new \stdClass();
                $jsonValuesForCashier->cashier_id = $valueCashier['id'];
                $jsonValuesForCashier->cashier_name = $valueCashier['name'];
                $jsonValuesForCashier->cashier_second_name = $valueCashier['second_name'];
                $jsonValuesForCashier->agreement_id = $valueCashier['agreement_id'];

                $AllCashierAgreements = CashierAgreements::find()->where(['=', 'id', $valueCashier['agreement_id']])->orderBy('id')->limit(1)->asArray()->all();
---
SELECT * FROM "cashier"
SELECT * FROM "cashier_agreements" WHERE "id" = 777 ORDER BY "id" LIMIT 1